{
    "metadata": {
        "total_size": 3863374304,
        "total_parameters": 6866625008
    },
    "weight_map": {
        "model.language_model.altup_projections.0.biases": "model.safetensors",
        "model.language_model.altup_projections.0.scales": "model.safetensors",
        "model.language_model.altup_projections.0.weight": "model.safetensors",
        "model.language_model.altup_projections.1.biases": "model.safetensors",
        "model.language_model.altup_projections.1.scales": "model.safetensors",
        "model.language_model.altup_projections.1.weight": "model.safetensors",
        "model.language_model.altup_projections.2.biases": "model.safetensors",
        "model.language_model.altup_projections.2.scales": "model.safetensors",
        "model.language_model.altup_projections.2.weight": "model.safetensors",
        "model.language_model.altup_unembed_projections.0.biases": "model.safetensors",
        "model.language_model.altup_unembed_projections.0.scales": "model.safetensors",
        "model.language_model.altup_unembed_projections.0.weight": "model.safetensors",
        "model.language_model.altup_unembed_projections.1.biases": "model.safetensors",
        "model.language_model.altup_unembed_projections.1.scales": "model.safetensors",
        "model.language_model.altup_unembed_projections.1.weight": "model.safetensors",
        "model.language_model.altup_unembed_projections.2.biases": "model.safetensors",
        "model.language_model.altup_unembed_projections.2.scales": "model.safetensors",
        "model.language_model.altup_unembed_projections.2.weight": "model.safetensors",
        "model.language_model.embed_tokens.biases": "model.safetensors",
        "model.language_model.embed_tokens.scales": "model.safetensors",
        "model.language_model.embed_tokens.weight": "model.safetensors",
        "model.language_model.embed_tokens_per_layer.biases": "model.safetensors",
        "model.language_model.embed_tokens_per_layer.scales": "model.safetensors",
        "model.language_model.embed_tokens_per_layer.weight": "model.safetensors",
        "model.language_model.layers.0.altup.correct_output_scale": "model.safetensors",
        "model.language_model.layers.0.altup.correction_coefs.weight": "model.safetensors",
        "model.language_model.layers.0.altup.modality_router.biases": "model.safetensors",
        "model.language_model.layers.0.altup.modality_router.scales": "model.safetensors",
        "model.language_model.layers.0.altup.modality_router.weight": "model.safetensors",
        "model.language_model.layers.0.altup.prediction_coefs.weight": "model.safetensors",
        "model.language_model.layers.0.altup.router_norm.weight": "model.safetensors",
        "model.language_model.layers.0.input_layernorm.weight": "model.safetensors",
        "model.language_model.layers.0.laurel.linear_left.biases": "model.safetensors",
        "model.language_model.layers.0.laurel.linear_left.scales": "model.safetensors",
        "model.language_model.layers.0.laurel.linear_left.weight": "model.safetensors",
        "model.language_model.layers.0.laurel.linear_right.biases": "model.safetensors",
        "model.language_model.layers.0.laurel.linear_right.scales": "model.safetensors",
        "model.language_model.layers.0.laurel.linear_right.weight": "model.safetensors",
        "model.language_model.layers.0.laurel.post_laurel_norm.weight": "model.safetensors",
        "model.language_model.layers.0.mlp.down_proj.biases": "model.safetensors",
        "model.language_model.layers.0.mlp.down_proj.scales": "model.safetensors",
        "model.language_model.layers.0.mlp.down_proj.weight": "model.safetensors",
        "model.language_model.layers.0.mlp.gate_proj.biases": "model.safetensors",
        "model.language_model.layers.0.mlp.gate_proj.scales": "model.safetensors",
        "model.language_model.layers.0.mlp.gate_proj.weight": "model.safetensors",
        "model.language_model.layers.0.mlp.up_proj.biases": "model.safetensors",
        "model.language_model.layers.0.mlp.up_proj.scales": "model.safetensors",
        "model.language_model.layers.0.mlp.up_proj.weight": "model.safetensors",
        "model.language_model.layers.0.per_layer_input_gate.biases": "model.safetensors",
        "model.language_model.layers.0.per_layer_input_gate.scales": "model.safetensors",
        "model.language_model.layers.0.per_layer_input_gate.weight": "model.safetensors",
        "model.language_model.layers.0.per_layer_projection.biases": "model.safetensors",
        "model.language_model.layers.0.per_layer_projection.scales": "model.safetensors",
        "model.language_model.layers.0.per_layer_projection.weight": "model.safetensors",
        "model.language_model.layers.0.post_attention_layernorm.weight": "model.safetensors",
        "model.language_model.layers.0.post_feedforward_layernorm.weight": "model.safetensors",
        "model.language_model.layers.0.post_per_layer_input_norm.weight": "model.safetensors",
        "model.language_model.layers.0.pre_feedforward_layernorm.weight": "model.safetensors",
        "model.language_model.layers.0.self_attn.k_norm.weight": "model.safetensors",
        "model.language_model.layers.0.self_attn.k_proj.biases": "model.safetensors",
        "model.language_model.layers.0.self_attn.k_proj.scales": "model.safetensors",
        "model.language_model.layers.0.self_attn.k_proj.weight": "model.safetensors",
        "model.language_model.layers.0.self_attn.o_proj.biases": "model.safetensors",
        "model.language_model.layers.0.self_attn.o_proj.scales": "model.safetensors",
        "model.language_model.layers.0.self_attn.o_proj.weight": "model.safetensors",
        "model.language_model.layers.0.self_attn.q_norm.weight": "model.safetensors",
        "model.language_model.layers.0.self_attn.q_proj.biases": "model.safetensors",
        "model.language_model.layers.0.self_attn.q_proj.scales": "model.safetensors",
        "model.language_model.layers.0.self_attn.q_proj.weight": "model.safetensors",
        "model.language_model.layers.0.self_attn.v_proj.biases": "model.safetensors",
        "model.language_model.layers.0.self_attn.v_proj.scales": "model.safetensors",
        "model.language_model.layers.0.self_attn.v_proj.weight": "model.safetensors",
        "model.language_model.layers.1.altup.correct_output_scale": "model.safetensors",
        "model.language_model.layers.1.altup.correction_coefs.weight": "model.safetensors",
        "model.language_model.layers.1.altup.modality_router.biases": "model.safetensors",
        "model.language_model.layers.1.altup.modality_router.scales": "model.safetensors",
        "model.language_model.layers.1.altup.modality_router.weight": "model.safetensors",
        "model.language_model.layers.1.altup.prediction_coefs.weight": "model.safetensors",
        "model.language_model.layers.1.altup.router_norm.weight": "model.safetensors",
        "model.language_model.layers.1.input_layernorm.weight": "model.safetensors",
        "model.language_model.layers.1.laurel.linear_left.biases": "model.safetensors",
        "model.language_model.layers.1.laurel.linear_left.scales": "model.safetensors",
        "model.language_model.layers.1.laurel.linear_left.weight": "model.safetensors",
        "model.language_model.layers.1.laurel.linear_right.biases": "model.safetensors",
        "model.language_model.layers.1.laurel.linear_right.scales": "model.safetensors",
        "model.language_model.layers.1.laurel.linear_right.weight": "model.safetensors",
        "model.language_model.layers.1.laurel.post_laurel_norm.weight": "model.safetensors",
        "model.language_model.layers.1.mlp.down_proj.biases": "model.safetensors",
        "model.language_model.layers.1.mlp.down_proj.scales": "model.safetensors",
        "model.language_model.layers.1.mlp.down_proj.weight": "model.safetensors",
        "model.language_model.layers.1.mlp.gate_proj.biases": "model.safetensors",
        "model.language_model.layers.1.mlp.gate_proj.scales": "model.safetensors",
        "model.language_model.layers.1.mlp.gate_proj.weight": "model.safetensors",
        "model.language_model.layers.1.mlp.up_proj.biases": "model.safetensors",
        "model.language_model.layers.1.mlp.up_proj.scales": "model.safetensors",
        "model.language_model.layers.1.mlp.up_proj.weight": "model.safetensors",
        "model.language_model.layers.1.per_layer_input_gate.biases": "model.safetensors",
        "model.language_model.layers.1.per_layer_input_gate.scales": "model.safetensors",
        "model.language_model.layers.1.per_layer_input_gate.weight": "model.safetensors",
        "model.language_model.layers.1.per_layer_projection.biases": "model.safetensors",
        "model.language_model.layers.1.per_layer_projection.scales": "model.safetensors",
        "model.language_model.layers.1.per_layer_projection.weight": "model.safetensors",
        "model.language_model.layers.1.post_attention_layernorm.weight": "model.safetensors",
        "model.language_model.layers.1.post_feedforward_layernorm.weight": "model.safetensors",
        "model.language_model.layers.1.post_per_layer_input_norm.weight": "model.safetensors",
        "model.language_model.layers.1.pre_feedforward_layernorm.weight": "model.safetensors",
        "model.language_model.layers.1.self_attn.k_norm.weight": "model.safetensors",
        "model.language_model.layers.1.self_attn.k_proj.biases": "model.safetensors",
        "model.language_model.layers.1.self_attn.k_proj.scales": "model.safetensors",
        "model.language_model.layers.1.self_attn.k_proj.weight": "model.safetensors",
        "model.language_model.layers.1.self_attn.o_proj.biases": "model.safetensors",
        "model.language_model.layers.1.self_attn.o_proj.scales": "model.safetensors",
        "model.language_model.layers.1.self_attn.o_proj.weight": "model.safetensors",
        "model.language_model.layers.1.self_attn.q_norm.weight": "model.safetensors",
        "model.language_model.layers.1.self_attn.q_proj.biases": "model.safetensors",
        "model.language_model.layers.1.self_attn.q_proj.scales": "model.safetensors",
        "model.language_model.layers.1.self_attn.q_proj.weight": "model.safetensors",
        "model.language_model.layers.1.self_attn.v_proj.biases": "model.safetensors",
        "model.language_model.layers.1.self_attn.v_proj.scales": "model.safetensors",
        "model.language_model.layers.1.self_attn.v_proj.weight": "model.safetensors",
        "model.language_model.layers.10.altup.correct_output_scale": "model.safetensors",
        "model.language_model.layers.10.altup.correction_coefs.weight": "model.safetensors",
        "model.language_model.layers.10.altup.modality_router.biases": "model.safetensors",
        "model.language_model.layers.10.altup.modality_router.scales": "model.safetensors",
        "model.language_model.layers.10.altup.modality_router.weight": "model.safetensors",
        "model.language_model.layers.10.altup.prediction_coefs.weight": "model.safetensors",
        "model.language_model.layers.10.altup.router_norm.weight": "model.safetensors",
        "model.language_model.layers.10.input_layernorm.weight": "model.safetensors",
        "model.language_model.layers.10.laurel.linear_left.biases": "model.safetensors",
        "model.language_model.layers.10.laurel.linear_left.scales": "model.safetensors",
        "model.language_model.layers.10.laurel.linear_left.weight": "model.safetensors",
        "model.language_model.layers.10.laurel.linear_right.biases": "model.safetensors",
        "model.language_model.layers.10.laurel.linear_right.scales": "model.safetensors",
        "model.language_model.layers.10.laurel.linear_right.weight": "model.safetensors",
        "model.language_model.layers.10.laurel.post_laurel_norm.weight": "model.safetensors",
        "model.language_model.layers.10.mlp.down_proj.biases": "model.safetensors",
        "model.language_model.layers.10.mlp.down_proj.scales": "model.safetensors",
        "model.language_model.layers.10.mlp.down_proj.weight": "model.safetensors",
        "model.language_model.layers.10.mlp.gate_proj.biases": "model.safetensors",
        "model.language_model.layers.10.mlp.gate_proj.scales": "model.safetensors",
        "model.language_model.layers.10.mlp.gate_proj.weight": "model.safetensors",
        "model.language_model.layers.10.mlp.up_proj.biases": "model.safetensors",
        "model.language_model.layers.10.mlp.up_proj.scales": "model.safetensors",
        "model.language_model.layers.10.mlp.up_proj.weight": "model.safetensors",
        "model.language_model.layers.10.per_layer_input_gate.biases": "model.safetensors",
        "model.language_model.layers.10.per_layer_input_gate.scales": "model.safetensors",
        "model.language_model.layers.10.per_layer_input_gate.weight": "model.safetensors",
        "model.language_model.layers.10.per_layer_projection.biases": "model.safetensors",
        "model.language_model.layers.10.per_layer_projection.scales": "model.safetensors",
        "model.language_model.layers.10.per_layer_projection.weight": "model.safetensors",
        "model.language_model.layers.10.post_attention_layernorm.weight": "model.safetensors",
        "model.language_model.layers.10.post_feedforward_layernorm.weight": "model.safetensors",
        "model.language_model.layers.10.post_per_layer_input_norm.weight": "model.safetensors",
        "model.language_model.layers.10.pre_feedforward_layernorm.weight": "model.safetensors",
        "model.language_model.layers.10.self_attn.k_norm.weight": "model.safetensors",
        "model.language_model.layers.10.self_attn.k_proj.biases": "model.safetensors",
        "model.language_model.layers.10.self_attn.k_proj.scales": "model.safetensors",
        "model.language_model.layers.10.self_attn.k_proj.weight": "model.safetensors",
        "model.language_model.layers.10.self_attn.o_proj.biases": "model.safetensors",
        "model.language_model.layers.10.self_attn.o_proj.scales": "model.safetensors",
        "model.language_model.layers.10.self_attn.o_proj.weight": "model.safetensors",
        "model.language_model.layers.10.self_attn.q_norm.weight": "model.safetensors",
        "model.language_model.layers.10.self_attn.q_proj.biases": "model.safetensors",
        "model.language_model.layers.10.self_attn.q_proj.scales": "model.safetensors",
        "model.language_model.layers.10.self_attn.q_proj.weight": "model.safetensors",
        "model.language_model.layers.10.self_attn.v_proj.biases": "model.safetensors",
        "model.language_model.layers.10.self_attn.v_proj.scales": "model.safetensors",
        "model.language_model.layers.10.self_attn.v_proj.weight": "model.safetensors",
        "model.language_model.layers.11.altup.correct_output_scale": "model.safetensors",
        "model.language_model.layers.11.altup.correction_coefs.weight": "model.safetensors",
        "model.language_model.layers.11.altup.modality_router.biases": "model.safetensors",
        "model.language_model.layers.11.altup.modality_router.scales": "model.safetensors",
        "model.language_model.layers.11.altup.modality_router.weight": "model.safetensors",
        "model.language_model.layers.11.altup.prediction_coefs.weight": "model.safetensors",
        "model.language_model.layers.11.altup.router_norm.weight": "model.safetensors",
        "model.language_model.layers.11.input_layernorm.weight": "model.safetensors",
        "model.language_model.layers.11.laurel.linear_left.biases": "model.safetensors",
        "model.language_model.layers.11.laurel.linear_left.scales": "model.safetensors",
        "model.language_model.layers.11.laurel.linear_left.weight": "model.safetensors",
        "model.language_model.layers.11.laurel.linear_right.biases": "model.safetensors",
        "model.language_model.layers.11.laurel.linear_right.scales": "model.safetensors",
        "model.language_model.layers.11.laurel.linear_right.weight": "model.safetensors",
        "model.language_model.layers.11.laurel.post_laurel_norm.weight": "model.safetensors",
        "model.language_model.layers.11.mlp.down_proj.biases": "model.safetensors",
        "model.language_model.layers.11.mlp.down_proj.scales": "model.safetensors",
        "model.language_model.layers.11.mlp.down_proj.weight": "model.safetensors",
        "model.language_model.layers.11.mlp.gate_proj.biases": "model.safetensors",
        "model.language_model.layers.11.mlp.gate_proj.scales": "model.safetensors",
        "model.language_model.layers.11.mlp.gate_proj.weight": "model.safetensors",
        "model.language_model.layers.11.mlp.up_proj.biases": "model.safetensors",
        "model.language_model.layers.11.mlp.up_proj.scales": "model.safetensors",
        "model.language_model.layers.11.mlp.up_proj.weight": "model.safetensors",
        "model.language_model.layers.11.per_layer_input_gate.biases": "model.safetensors",
        "model.language_model.layers.11.per_layer_input_gate.scales": "model.safetensors",
        "model.language_model.layers.11.per_layer_input_gate.weight": "model.safetensors",
        "model.language_model.layers.11.per_layer_projection.biases": "model.safetensors",
        "model.language_model.layers.11.per_layer_projection.scales": "model.safetensors",
        "model.language_model.layers.11.per_layer_projection.weight": "model.safetensors",
        "model.language_model.layers.11.post_attention_layernorm.weight": "model.safetensors",
        "model.language_model.layers.11.post_feedforward_layernorm.weight": "model.safetensors",
        "model.language_model.layers.11.post_per_layer_input_norm.weight": "model.safetensors",
        "model.language_model.layers.11.pre_feedforward_layernorm.weight": "model.safetensors",
        "model.language_model.layers.11.self_attn.k_norm.weight": "model.safetensors",
        "model.language_model.layers.11.self_attn.k_proj.biases": "model.safetensors",
        "model.language_model.layers.11.self_attn.k_proj.scales": "model.safetensors",
        "model.language_model.layers.11.self_attn.k_proj.weight": "model.safetensors",
        "model.language_model.layers.11.self_attn.o_proj.biases": "model.safetensors",
        "model.language_model.layers.11.self_attn.o_proj.scales": "model.safetensors",
        "model.language_model.layers.11.self_attn.o_proj.weight": "model.safetensors",
        "model.language_model.layers.11.self_attn.q_norm.weight": "model.safetensors",
        "model.language_model.layers.11.self_attn.q_proj.biases": "model.safetensors",
        "model.language_model.layers.11.self_attn.q_proj.scales": "model.safetensors",
        "model.language_model.layers.11.self_attn.q_proj.weight": "model.safetensors",
        "model.language_model.layers.11.self_attn.v_proj.biases": "model.safetensors",
        "model.language_model.layers.11.self_attn.v_proj.scales": "model.safetensors",
        "model.language_model.layers.11.self_attn.v_proj.weight": "model.safetensors",
        "model.language_model.layers.12.altup.correct_output_scale": "model.safetensors",
        "model.language_model.layers.12.altup.correction_coefs.weight": "model.safetensors",
        "model.language_model.layers.12.altup.modality_router.biases": "model.safetensors",
        "model.language_model.layers.12.altup.modality_router.scales": "model.safetensors",
        "model.language_model.layers.12.altup.modality_router.weight": "model.safetensors",
        "model.language_model.layers.12.altup.prediction_coefs.weight": "model.safetensors",
        "model.language_model.layers.12.altup.router_norm.weight": "model.safetensors",
        "model.language_model.layers.12.input_layernorm.weight": "model.safetensors",
        "model.language_model.layers.12.laurel.linear_left.biases": "model.safetensors",
        "model.language_model.layers.12.laurel.linear_left.scales": "model.safetensors",
        "model.language_model.layers.12.laurel.linear_left.weight": "model.safetensors",
        "model.language_model.layers.12.laurel.linear_right.biases": "model.safetensors",
        "model.language_model.layers.12.laurel.linear_right.scales": "model.safetensors",
        "model.language_model.layers.12.laurel.linear_right.weight": "model.safetensors",
        "model.language_model.layers.12.laurel.post_laurel_norm.weight": "model.safetensors",
        "model.language_model.layers.12.mlp.down_proj.biases": "model.safetensors",
        "model.language_model.layers.12.mlp.down_proj.scales": "model.safetensors",
        "model.language_model.layers.12.mlp.down_proj.weight": "model.safetensors",
        "model.language_model.layers.12.mlp.gate_proj.biases": "model.safetensors",
        "model.language_model.layers.12.mlp.gate_proj.scales": "model.safetensors",
        "model.language_model.layers.12.mlp.gate_proj.weight": "model.safetensors",
        "model.language_model.layers.12.mlp.up_proj.biases": "model.safetensors",
        "model.language_model.layers.12.mlp.up_proj.scales": "model.safetensors",
        "model.language_model.layers.12.mlp.up_proj.weight": "model.safetensors",
        "model.language_model.layers.12.per_layer_input_gate.biases": "model.safetensors",
        "model.language_model.layers.12.per_layer_input_gate.scales": "model.safetensors",
        "model.language_model.layers.12.per_layer_input_gate.weight": "model.safetensors",
        "model.language_model.layers.12.per_layer_projection.biases": "model.safetensors",
        "model.language_model.layers.12.per_layer_projection.scales": "model.safetensors",
        "model.language_model.layers.12.per_layer_projection.weight": "model.safetensors",
        "model.language_model.layers.12.post_attention_layernorm.weight": "model.safetensors",
        "model.language_model.layers.12.post_feedforward_layernorm.weight": "model.safetensors",
        "model.language_model.layers.12.post_per_layer_input_norm.weight": "model.safetensors",
        "model.language_model.layers.12.pre_feedforward_layernorm.weight": "model.safetensors",
        "model.language_model.layers.12.self_attn.k_norm.weight": "model.safetensors",
        "model.language_model.layers.12.self_attn.k_proj.biases": "model.safetensors",
        "model.language_model.layers.12.self_attn.k_proj.scales": "model.safetensors",
        "model.language_model.layers.12.self_attn.k_proj.weight": "model.safetensors",
        "model.language_model.layers.12.self_attn.o_proj.biases": "model.safetensors",
        "model.language_model.layers.12.self_attn.o_proj.scales": "model.safetensors",
        "model.language_model.layers.12.self_attn.o_proj.weight": "model.safetensors",
        "model.language_model.layers.12.self_attn.q_norm.weight": "model.safetensors",
        "model.language_model.layers.12.self_attn.q_proj.biases": "model.safetensors",
        "model.language_model.layers.12.self_attn.q_proj.scales": "model.safetensors",
        "model.language_model.layers.12.self_attn.q_proj.weight": "model.safetensors",
        "model.language_model.layers.12.self_attn.v_proj.biases": "model.safetensors",
        "model.language_model.layers.12.self_attn.v_proj.scales": "model.safetensors",
        "model.language_model.layers.12.self_attn.v_proj.weight": "model.safetensors",
        "model.language_model.layers.13.altup.correct_output_scale": "model.safetensors",
        "model.language_model.layers.13.altup.correction_coefs.weight": "model.safetensors",
        "model.language_model.layers.13.altup.modality_router.biases": "model.safetensors",
        "model.language_model.layers.13.altup.modality_router.scales": "model.safetensors",
        "model.language_model.layers.13.altup.modality_router.weight": "model.safetensors",
        "model.language_model.layers.13.altup.prediction_coefs.weight": "model.safetensors",
        "model.language_model.layers.13.altup.router_norm.weight": "model.safetensors",
        "model.language_model.layers.13.input_layernorm.weight": "model.safetensors",
        "model.language_model.layers.13.laurel.linear_left.biases": "model.safetensors",
        "model.language_model.layers.13.laurel.linear_left.scales": "model.safetensors",
        "model.language_model.layers.13.laurel.linear_left.weight": "model.safetensors",
        "model.language_model.layers.13.laurel.linear_right.biases": "model.safetensors",
        "model.language_model.layers.13.laurel.linear_right.scales": "model.safetensors",
        "model.language_model.layers.13.laurel.linear_right.weight": "model.safetensors",
        "model.language_model.layers.13.laurel.post_laurel_norm.weight": "model.safetensors",
        "model.language_model.layers.13.mlp.down_proj.biases": "model.safetensors",
        "model.language_model.layers.13.mlp.down_proj.scales": "model.safetensors",
        "model.language_model.layers.13.mlp.down_proj.weight": "model.safetensors",
        "model.language_model.layers.13.mlp.gate_proj.biases": "model.safetensors",
        "model.language_model.layers.13.mlp.gate_proj.scales": "model.safetensors",
        "model.language_model.layers.13.mlp.gate_proj.weight": "model.safetensors",
        "model.language_model.layers.13.mlp.up_proj.biases": "model.safetensors",
        "model.language_model.layers.13.mlp.up_proj.scales": "model.safetensors",
        "model.language_model.layers.13.mlp.up_proj.weight": "model.safetensors",
        "model.language_model.layers.13.per_layer_input_gate.biases": "model.safetensors",
        "model.language_model.layers.13.per_layer_input_gate.scales": "model.safetensors",
        "model.language_model.layers.13.per_layer_input_gate.weight": "model.safetensors",
        "model.language_model.layers.13.per_layer_projection.biases": "model.safetensors",
        "model.language_model.layers.13.per_layer_projection.scales": "model.safetensors",
        "model.language_model.layers.13.per_layer_projection.weight": "model.safetensors",
        "model.language_model.layers.13.post_attention_layernorm.weight": "model.safetensors",
        "model.language_model.layers.13.post_feedforward_layernorm.weight": "model.safetensors",
        "model.language_model.layers.13.post_per_layer_input_norm.weight": "model.safetensors",
        "model.language_model.layers.13.pre_feedforward_layernorm.weight": "model.safetensors",
        "model.language_model.layers.13.self_attn.k_norm.weight": "model.safetensors",
        "model.language_model.layers.13.self_attn.k_proj.biases": "model.safetensors",
        "model.language_model.layers.13.self_attn.k_proj.scales": "model.safetensors",
        "model.language_model.layers.13.self_attn.k_proj.weight": "model.safetensors",
        "model.language_model.layers.13.self_attn.o_proj.biases": "model.safetensors",
        "model.language_model.layers.13.self_attn.o_proj.scales": "model.safetensors",
        "model.language_model.layers.13.self_attn.o_proj.weight": "model.safetensors",
        "model.language_model.layers.13.self_attn.q_norm.weight": "model.safetensors",
        "model.language_model.layers.13.self_attn.q_proj.biases": "model.safetensors",
        "model.language_model.layers.13.self_attn.q_proj.scales": "model.safetensors",
        "model.language_model.layers.13.self_attn.q_proj.weight": "model.safetensors",
        "model.language_model.layers.13.self_attn.v_proj.biases": "model.safetensors",
        "model.language_model.layers.13.self_attn.v_proj.scales": "model.safetensors",
        "model.language_model.layers.13.self_attn.v_proj.weight": "model.safetensors",
        "model.language_model.layers.14.altup.correct_output_scale": "model.safetensors",
        "model.language_model.layers.14.altup.correction_coefs.weight": "model.safetensors",
        "model.language_model.layers.14.altup.modality_router.biases": "model.safetensors",
        "model.language_model.layers.14.altup.modality_router.scales": "model.safetensors",
        "model.language_model.layers.14.altup.modality_router.weight": "model.safetensors",
        "model.language_model.layers.14.altup.prediction_coefs.weight": "model.safetensors",
        "model.language_model.layers.14.altup.router_norm.weight": "model.safetensors",
        "model.language_model.layers.14.input_layernorm.weight": "model.safetensors",
        "model.language_model.layers.14.laurel.linear_left.biases": "model.safetensors",
        "model.language_model.layers.14.laurel.linear_left.scales": "model.safetensors",
        "model.language_model.layers.14.laurel.linear_left.weight": "model.safetensors",
        "model.language_model.layers.14.laurel.linear_right.biases": "model.safetensors",
        "model.language_model.layers.14.laurel.linear_right.scales": "model.safetensors",
        "model.language_model.layers.14.laurel.linear_right.weight": "model.safetensors",
        "model.language_model.layers.14.laurel.post_laurel_norm.weight": "model.safetensors",
        "model.language_model.layers.14.mlp.down_proj.biases": "model.safetensors",
        "model.language_model.layers.14.mlp.down_proj.scales": "model.safetensors",
        "model.language_model.layers.14.mlp.down_proj.weight": "model.safetensors",
        "model.language_model.layers.14.mlp.gate_proj.biases": "model.safetensors",
        "model.language_model.layers.14.mlp.gate_proj.scales": "model.safetensors",
        "model.language_model.layers.14.mlp.gate_proj.weight": "model.safetensors",
        "model.language_model.layers.14.mlp.up_proj.biases": "model.safetensors",
        "model.language_model.layers.14.mlp.up_proj.scales": "model.safetensors",
        "model.language_model.layers.14.mlp.up_proj.weight": "model.safetensors",
        "model.language_model.layers.14.per_layer_input_gate.biases": "model.safetensors",
        "model.language_model.layers.14.per_layer_input_gate.scales": "model.safetensors",
        "model.language_model.layers.14.per_layer_input_gate.weight": "model.safetensors",
        "model.language_model.layers.14.per_layer_projection.biases": "model.safetensors",
        "model.language_model.layers.14.per_layer_projection.scales": "model.safetensors",
        "model.language_model.layers.14.per_layer_projection.weight": "model.safetensors",
        "model.language_model.layers.14.post_attention_layernorm.weight": "model.safetensors",
        "model.language_model.layers.14.post_feedforward_layernorm.weight": "model.safetensors",
        "model.language_model.layers.14.post_per_layer_input_norm.weight": "model.safetensors",
        "model.language_model.layers.14.pre_feedforward_layernorm.weight": "model.safetensors",
        "model.language_model.layers.14.self_attn.k_norm.weight": "model.safetensors",
        "model.language_model.layers.14.self_attn.k_proj.biases": "model.safetensors",
        "model.language_model.layers.14.self_attn.k_proj.scales": "model.safetensors",
        "model.language_model.layers.14.self_attn.k_proj.weight": "model.safetensors",
        "model.language_model.layers.14.self_attn.o_proj.biases": "model.safetensors",
        "model.language_model.layers.14.self_attn.o_proj.scales": "model.safetensors",
        "model.language_model.layers.14.self_attn.o_proj.weight": "model.safetensors",
        "model.language_model.layers.14.self_attn.q_norm.weight": "model.safetensors",
        "model.language_model.layers.14.self_attn.q_proj.biases": "model.safetensors",
        "model.language_model.layers.14.self_attn.q_proj.scales": "model.safetensors",
        "model.language_model.layers.14.self_attn.q_proj.weight": "model.safetensors",
        "model.language_model.layers.14.self_attn.v_proj.biases": "model.safetensors",
        "model.language_model.layers.14.self_attn.v_proj.scales": "model.safetensors",
        "model.language_model.layers.14.self_attn.v_proj.weight": "model.safetensors",
        "model.language_model.layers.15.altup.correct_output_scale": "model.safetensors",
        "model.language_model.layers.15.altup.correction_coefs.weight": "model.safetensors",
        "model.language_model.layers.15.altup.modality_router.biases": "model.safetensors",
        "model.language_model.layers.15.altup.modality_router.scales": "model.safetensors",
        "model.language_model.layers.15.altup.modality_router.weight": "model.safetensors",
        "model.language_model.layers.15.altup.prediction_coefs.weight": "model.safetensors",
        "model.language_model.layers.15.altup.router_norm.weight": "model.safetensors",
        "model.language_model.layers.15.input_layernorm.weight": "model.safetensors",
        "model.language_model.layers.15.laurel.linear_left.biases": "model.safetensors",
        "model.language_model.layers.15.laurel.linear_left.scales": "model.safetensors",
        "model.language_model.layers.15.laurel.linear_left.weight": "model.safetensors",
        "model.language_model.layers.15.laurel.linear_right.biases": "model.safetensors",
        "model.language_model.layers.15.laurel.linear_right.scales": "model.safetensors",
        "model.language_model.layers.15.laurel.linear_right.weight": "model.safetensors",
        "model.language_model.layers.15.laurel.post_laurel_norm.weight": "model.safetensors",
        "model.language_model.layers.15.mlp.down_proj.biases": "model.safetensors",
        "model.language_model.layers.15.mlp.down_proj.scales": "model.safetensors",
        "model.language_model.layers.15.mlp.down_proj.weight": "model.safetensors",
        "model.language_model.layers.15.mlp.gate_proj.biases": "model.safetensors",
        "model.language_model.layers.15.mlp.gate_proj.scales": "model.safetensors",
        "model.language_model.layers.15.mlp.gate_proj.weight": "model.safetensors",
        "model.language_model.layers.15.mlp.up_proj.biases": "model.safetensors",
        "model.language_model.layers.15.mlp.up_proj.scales": "model.safetensors",
        "model.language_model.layers.15.mlp.up_proj.weight": "model.safetensors",
        "model.language_model.layers.15.per_layer_input_gate.biases": "model.safetensors",
        "model.language_model.layers.15.per_layer_input_gate.scales": "model.safetensors",
        "model.language_model.layers.15.per_layer_input_gate.weight": "model.safetensors",
        "model.language_model.layers.15.per_layer_projection.biases": "model.safetensors",
        "model.language_model.layers.15.per_layer_projection.scales": "model.safetensors",
        "model.language_model.layers.15.per_layer_projection.weight": "model.safetensors",
        "model.language_model.layers.15.post_attention_layernorm.weight": "model.safetensors",
        "model.language_model.layers.15.post_feedforward_layernorm.weight": "model.safetensors",
        "model.language_model.layers.15.post_per_layer_input_norm.weight": "model.safetensors",
        "model.language_model.layers.15.pre_feedforward_layernorm.weight": "model.safetensors",
        "model.language_model.layers.15.self_attn.k_norm.weight": "model.safetensors",
        "model.language_model.layers.15.self_attn.k_proj.biases": "model.safetensors",
        "model.language_model.layers.15.self_attn.k_proj.scales": "model.safetensors",
        "model.language_model.layers.15.self_attn.k_proj.weight": "model.safetensors",
        "model.language_model.layers.15.self_attn.o_proj.biases": "model.safetensors",
        "model.language_model.layers.15.self_attn.o_proj.scales": "model.safetensors",
        "model.language_model.layers.15.self_attn.o_proj.weight": "model.safetensors",
        "model.language_model.layers.15.self_attn.q_norm.weight": "model.safetensors",
        "model.language_model.layers.15.self_attn.q_proj.biases": "model.safetensors",
        "model.language_model.layers.15.self_attn.q_proj.scales": "model.safetensors",
        "model.language_model.layers.15.self_attn.q_proj.weight": "model.safetensors",
        "model.language_model.layers.15.self_attn.v_proj.biases": "model.safetensors",
        "model.language_model.layers.15.self_attn.v_proj.scales": "model.safetensors",
        "model.language_model.layers.15.self_attn.v_proj.weight": "model.safetensors",
        "model.language_model.layers.16.altup.correct_output_scale": "model.safetensors",
        "model.language_model.layers.16.altup.correction_coefs.weight": "model.safetensors",
        "model.language_model.layers.16.altup.modality_router.biases": "model.safetensors",
        "model.language_model.layers.16.altup.modality_router.scales": "model.safetensors",
        "model.language_model.layers.16.altup.modality_router.weight": "model.safetensors",
        "model.language_model.layers.16.altup.prediction_coefs.weight": "model.safetensors",
        "model.language_model.layers.16.altup.router_norm.weight": "model.safetensors",
        "model.language_model.layers.16.input_layernorm.weight": "model.safetensors",
        "model.language_model.layers.16.laurel.linear_left.biases": "model.safetensors",
        "model.language_model.layers.16.laurel.linear_left.scales": "model.safetensors",
        "model.language_model.layers.16.laurel.linear_left.weight": "model.safetensors",
        "model.language_model.layers.16.laurel.linear_right.biases": "model.safetensors",
        "model.language_model.layers.16.laurel.linear_right.scales": "model.safetensors",
        "model.language_model.layers.16.laurel.linear_right.weight": "model.safetensors",
        "model.language_model.layers.16.laurel.post_laurel_norm.weight": "model.safetensors",
        "model.language_model.layers.16.mlp.down_proj.biases": "model.safetensors",
        "model.language_model.layers.16.mlp.down_proj.scales": "model.safetensors",
        "model.language_model.layers.16.mlp.down_proj.weight": "model.safetensors",
        "model.language_model.layers.16.mlp.gate_proj.biases": "model.safetensors",
        "model.language_model.layers.16.mlp.gate_proj.scales": "model.safetensors",
        "model.language_model.layers.16.mlp.gate_proj.weight": "model.safetensors",
        "model.language_model.layers.16.mlp.up_proj.biases": "model.safetensors",
        "model.language_model.layers.16.mlp.up_proj.scales": "model.safetensors",
        "model.language_model.layers.16.mlp.up_proj.weight": "model.safetensors",
        "model.language_model.layers.16.per_layer_input_gate.biases": "model.safetensors",
        "model.language_model.layers.16.per_layer_input_gate.scales": "model.safetensors",
        "model.language_model.layers.16.per_layer_input_gate.weight": "model.safetensors",
        "model.language_model.layers.16.per_layer_projection.biases": "model.safetensors",
        "model.language_model.layers.16.per_layer_projection.scales": "model.safetensors",
        "model.language_model.layers.16.per_layer_projection.weight": "model.safetensors",
        "model.language_model.layers.16.post_attention_layernorm.weight": "model.safetensors",
        "model.language_model.layers.16.post_feedforward_layernorm.weight": "model.safetensors",
        "model.language_model.layers.16.post_per_layer_input_norm.weight": "model.safetensors",
        "model.language_model.layers.16.pre_feedforward_layernorm.weight": "model.safetensors",
        "model.language_model.layers.16.self_attn.k_norm.weight": "model.safetensors",
        "model.language_model.layers.16.self_attn.k_proj.biases": "model.safetensors",
        "model.language_model.layers.16.self_attn.k_proj.scales": "model.safetensors",
        "model.language_model.layers.16.self_attn.k_proj.weight": "model.safetensors",
        "model.language_model.layers.16.self_attn.o_proj.biases": "model.safetensors",
        "model.language_model.layers.16.self_attn.o_proj.scales": "model.safetensors",
        "model.language_model.layers.16.self_attn.o_proj.weight": "model.safetensors",
        "model.language_model.layers.16.self_attn.q_norm.weight": "model.safetensors",
        "model.language_model.layers.16.self_attn.q_proj.biases": "model.safetensors",
        "model.language_model.layers.16.self_attn.q_proj.scales": "model.safetensors",
        "model.language_model.layers.16.self_attn.q_proj.weight": "model.safetensors",
        "model.language_model.layers.16.self_attn.v_proj.biases": "model.safetensors",
        "model.language_model.layers.16.self_attn.v_proj.scales": "model.safetensors",
        "model.language_model.layers.16.self_attn.v_proj.weight": "model.safetensors",
        "model.language_model.layers.17.altup.correct_output_scale": "model.safetensors",
        "model.language_model.layers.17.altup.correction_coefs.weight": "model.safetensors",
        "model.language_model.layers.17.altup.modality_router.biases": "model.safetensors",
        "model.language_model.layers.17.altup.modality_router.scales": "model.safetensors",
        "model.language_model.layers.17.altup.modality_router.weight": "model.safetensors",
        "model.language_model.layers.17.altup.prediction_coefs.weight": "model.safetensors",
        "model.language_model.layers.17.altup.router_norm.weight": "model.safetensors",
        "model.language_model.layers.17.input_layernorm.weight": "model.safetensors",
        "model.language_model.layers.17.laurel.linear_left.biases": "model.safetensors",
        "model.language_model.layers.17.laurel.linear_left.scales": "model.safetensors",
        "model.language_model.layers.17.laurel.linear_left.weight": "model.safetensors",
        "model.language_model.layers.17.laurel.linear_right.biases": "model.safetensors",
        "model.language_model.layers.17.laurel.linear_right.scales": "model.safetensors",
        "model.language_model.layers.17.laurel.linear_right.weight": "model.safetensors",
        "model.language_model.layers.17.laurel.post_laurel_norm.weight": "model.safetensors",
        "model.language_model.layers.17.mlp.down_proj.biases": "model.safetensors",
        "model.language_model.layers.17.mlp.down_proj.scales": "model.safetensors",
        "model.language_model.layers.17.mlp.down_proj.weight": "model.safetensors",
        "model.language_model.layers.17.mlp.gate_proj.biases": "model.safetensors",
        "model.language_model.layers.17.mlp.gate_proj.scales": "model.safetensors",
        "model.language_model.layers.17.mlp.gate_proj.weight": "model.safetensors",
        "model.language_model.layers.17.mlp.up_proj.biases": "model.safetensors",
        "model.language_model.layers.17.mlp.up_proj.scales": "model.safetensors",
        "model.language_model.layers.17.mlp.up_proj.weight": "model.safetensors",
        "model.language_model.layers.17.per_layer_input_gate.biases": "model.safetensors",
        "model.language_model.layers.17.per_layer_input_gate.scales": "model.safetensors",
        "model.language_model.layers.17.per_layer_input_gate.weight": "model.safetensors",
        "model.language_model.layers.17.per_layer_projection.biases": "model.safetensors",
        "model.language_model.layers.17.per_layer_projection.scales": "model.safetensors",
        "model.language_model.layers.17.per_layer_projection.weight": "model.safetensors",
        "model.language_model.layers.17.post_attention_layernorm.weight": "model.safetensors",
        "model.language_model.layers.17.post_feedforward_layernorm.weight": "model.safetensors",
        "model.language_model.layers.17.post_per_layer_input_norm.weight": "model.safetensors",
        "model.language_model.layers.17.pre_feedforward_layernorm.weight": "model.safetensors",
        "model.language_model.layers.17.self_attn.k_norm.weight": "model.safetensors",
        "model.language_model.layers.17.self_attn.k_proj.biases": "model.safetensors",
        "model.language_model.layers.17.self_attn.k_proj.scales": "model.safetensors",
        "model.language_model.layers.17.self_attn.k_proj.weight": "model.safetensors",
        "model.language_model.layers.17.self_attn.o_proj.biases": "model.safetensors",
        "model.language_model.layers.17.self_attn.o_proj.scales": "model.safetensors",
        "model.language_model.layers.17.self_attn.o_proj.weight": "model.safetensors",
        "model.language_model.layers.17.self_attn.q_norm.weight": "model.safetensors",
        "model.language_model.layers.17.self_attn.q_proj.biases": "model.safetensors",
        "model.language_model.layers.17.self_attn.q_proj.scales": "model.safetensors",
        "model.language_model.layers.17.self_attn.q_proj.weight": "model.safetensors",
        "model.language_model.layers.17.self_attn.v_proj.biases": "model.safetensors",
        "model.language_model.layers.17.self_attn.v_proj.scales": "model.safetensors",
        "model.language_model.layers.17.self_attn.v_proj.weight": "model.safetensors",
        "model.language_model.layers.18.altup.correct_output_scale": "model.safetensors",
        "model.language_model.layers.18.altup.correction_coefs.weight": "model.safetensors",
        "model.language_model.layers.18.altup.modality_router.biases": "model.safetensors",
        "model.language_model.layers.18.altup.modality_router.scales": "model.safetensors",
        "model.language_model.layers.18.altup.modality_router.weight": "model.safetensors",
        "model.language_model.layers.18.altup.prediction_coefs.weight": "model.safetensors",
        "model.language_model.layers.18.altup.router_norm.weight": "model.safetensors",
        "model.language_model.layers.18.input_layernorm.weight": "model.safetensors",
        "model.language_model.layers.18.laurel.linear_left.biases": "model.safetensors",
        "model.language_model.layers.18.laurel.linear_left.scales": "model.safetensors",
        "model.language_model.layers.18.laurel.linear_left.weight": "model.safetensors",
        "model.language_model.layers.18.laurel.linear_right.biases": "model.safetensors",
        "model.language_model.layers.18.laurel.linear_right.scales": "model.safetensors",
        "model.language_model.layers.18.laurel.linear_right.weight": "model.safetensors",
        "model.language_model.layers.18.laurel.post_laurel_norm.weight": "model.safetensors",
        "model.language_model.layers.18.mlp.down_proj.biases": "model.safetensors",
        "model.language_model.layers.18.mlp.down_proj.scales": "model.safetensors",
        "model.language_model.layers.18.mlp.down_proj.weight": "model.safetensors",
        "model.language_model.layers.18.mlp.gate_proj.biases": "model.safetensors",
        "model.language_model.layers.18.mlp.gate_proj.scales": "model.safetensors",
        "model.language_model.layers.18.mlp.gate_proj.weight": "model.safetensors",
        "model.language_model.layers.18.mlp.up_proj.biases": "model.safetensors",
        "model.language_model.layers.18.mlp.up_proj.scales": "model.safetensors",
        "model.language_model.layers.18.mlp.up_proj.weight": "model.safetensors",
        "model.language_model.layers.18.per_layer_input_gate.biases": "model.safetensors",
        "model.language_model.layers.18.per_layer_input_gate.scales": "model.safetensors",
        "model.language_model.layers.18.per_layer_input_gate.weight": "model.safetensors",
        "model.language_model.layers.18.per_layer_projection.biases": "model.safetensors",
        "model.language_model.layers.18.per_layer_projection.scales": "model.safetensors",
        "model.language_model.layers.18.per_layer_projection.weight": "model.safetensors",
        "model.language_model.layers.18.post_attention_layernorm.weight": "model.safetensors",
        "model.language_model.layers.18.post_feedforward_layernorm.weight": "model.safetensors",
        "model.language_model.layers.18.post_per_layer_input_norm.weight": "model.safetensors",
        "model.language_model.layers.18.pre_feedforward_layernorm.weight": "model.safetensors",
        "model.language_model.layers.18.self_attn.k_norm.weight": "model.safetensors",
        "model.language_model.layers.18.self_attn.k_proj.biases": "model.safetensors",
        "model.language_model.layers.18.self_attn.k_proj.scales": "model.safetensors",
        "model.language_model.layers.18.self_attn.k_proj.weight": "model.safetensors",
        "model.language_model.layers.18.self_attn.o_proj.biases": "model.safetensors",
        "model.language_model.layers.18.self_attn.o_proj.scales": "model.safetensors",
        "model.language_model.layers.18.self_attn.o_proj.weight": "model.safetensors",
        "model.language_model.layers.18.self_attn.q_norm.weight": "model.safetensors",
        "model.language_model.layers.18.self_attn.q_proj.biases": "model.safetensors",
        "model.language_model.layers.18.self_attn.q_proj.scales": "model.safetensors",
        "model.language_model.layers.18.self_attn.q_proj.weight": "model.safetensors",
        "model.language_model.layers.18.self_attn.v_proj.biases": "model.safetensors",
        "model.language_model.layers.18.self_attn.v_proj.scales": "model.safetensors",
        "model.language_model.layers.18.self_attn.v_proj.weight": "model.safetensors",
        "model.language_model.layers.19.altup.correct_output_scale": "model.safetensors",
        "model.language_model.layers.19.altup.correction_coefs.weight": "model.safetensors",
        "model.language_model.layers.19.altup.modality_router.biases": "model.safetensors",
        "model.language_model.layers.19.altup.modality_router.scales": "model.safetensors",
        "model.language_model.layers.19.altup.modality_router.weight": "model.safetensors",
        "model.language_model.layers.19.altup.prediction_coefs.weight": "model.safetensors",
        "model.language_model.layers.19.altup.router_norm.weight": "model.safetensors",
        "model.language_model.layers.19.input_layernorm.weight": "model.safetensors",
        "model.language_model.layers.19.laurel.linear_left.biases": "model.safetensors",
        "model.language_model.layers.19.laurel.linear_left.scales": "model.safetensors",
        "model.language_model.layers.19.laurel.linear_left.weight": "model.safetensors",
        "model.language_model.layers.19.laurel.linear_right.biases": "model.safetensors",
        "model.language_model.layers.19.laurel.linear_right.scales": "model.safetensors",
